Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Additionally, Quarkus OIDC ships both a database-aware `TokenStateManager` that can integrate with most known databases and a Redis `TokenStateManager`. See the https://quarkus.io/guides/security-oidc-code-flow-authentication#handling-and-controlling-the-lifetime-of-authentication[section] for mor details.
ja_jp: さらに、Quarkus OIDC は、ほとんどの既知のデータベースと統合できるデータベース対応の `TokenStateManager` と、Redis `TokenStateManager` の両方を提供しています。詳細は https://quarkus.io/guides/security-oidc-code-flow-authentication#handling-and-controlling-the-lifetime-of-authentication[セクション] を参照してください。

source: Additionally, Quarkus includes extensions that make it easy to deploy serverless microservices to cloud providers including AWS Lambda, Azure Functions, and Google Cloud Functions as well as Knative to take advantage of Quarkus application’s fast startup times.
ja_jp: さらに、Quarkusには、サーバーレスマイクロサービスをAWS Lambda、Azure Functions、Google Cloud FunctionsなどのクラウドプロバイダーやKnativeに簡単にデプロイし、Quarkusアプリケーションの高速な起動時間を活用できるエクステンションが含まれています。

source: Additionally, REST Data with Panache can be used in conjunction with `io.quarkus.security.Authenticated`, by either:
ja_jp: さらに、REST Data with Panache は `io.quarkus.security.Authenticated` と組み合わせて、次のいずれかの方法で使用できます。

source: Additionally, `AccessTokenRequestReactiveFilter` can support a complex application that needs to exchange the tokens before propagating them.
ja_jp: さらに、 `AccessTokenRequestReactiveFilter` 、トークンを伝播する前に交換する必要がある複雑なアプリケーションをサポートすることができます。

source: Additionally, `AccessTokenRequestReactiveFilter` can support a complex application that needs to exchange tokens before propagating them.
ja_jp: さらに、 `AccessTokenRequestReactiveFilter` は、トークンを伝播する前に交換する必要がある複雑なアプリケーションをサポートできます。

source: Additionally, `OidcWiremockTestResource` set token issuer and audience to `https://service.example.com` which can be customized with `quarkus.test.oidc.token.issuer` and `quarkus.test.oidc.token.audience` system properties.
ja_jp: さらに、 `OidcWiremockTestResource` はトークン発行者と視聴者を `https://service.example.com` に設定します。これは `quarkus.test.oidc.token.issuer` と `quarkus.test.oidc.token.audience` システムのプロパティーでカスタマイズすることができます。

source: Additionally, `OidcWiremockTestResource` sets the token issuer and audience to `https://service.example.com`, which can be customized with `quarkus.test.oidc.token.issuer` and `quarkus.test.oidc.token.audience` system properties.
ja_jp: さらに、 `OidcWiremockTestResource` はトークンの発行者と対象ユーザーを `https://service.example.com` に設定します。これは、 `quarkus.test.oidc.token.issuer` および `quarkus.test.oidc.token.audience` システムプロパティーを使用してカスタマイズできます。

source: Additionally, `quarkus-oidc` provides a simple default memory based token cache which implements both `quarkus.oidc.TokenIntrospectionCache` and `quarkus.oidc.UserInfoCache` interfaces.
ja_jp: さらに、 `quarkus-oidc` は、 `quarkus.oidc.TokenIntrospectionCache` および `quarkus.oidc.UserInfoCache` インターフェイスの両方を実装するシンプルなデフォルトのメモリーベースのトークンキャッシュを提供します。

source: Additionally, `quarkus-oidc` provides a simple default memory-based token cache, which implements both `quarkus.oidc.TokenIntrospectionCache` and `quarkus.oidc.UserInfoCache` interfaces.
ja_jp: さらに、 `quarkus-oidc` は、 `quarkus.oidc.TokenIntrospectionCache` と `quarkus.oidc.UserInfoCache` の両方のインターフェイスを実装する、シンプルなデフォルトのメモリーベースのトークンキャッシュを提供します。

source: Additionally, a complex application may need to exchange or update the tokens before propagating them. For example, the access context might be different when `Service A` is accessing `Service B`. In this case, `Service A` might be granted a narrow or a completely different set of scopes to access `Service B`.
ja_jp: さらに、複雑なアプリケーションでは、トークンを伝搬する前に交換または更新する必要がある場合があります。たとえば、 `Service A` が `Service B` にアクセスするとき、アクセスコンテキストが異なるかもしれません。この場合、 `Service A` には `Service B` にアクセスするための狭いスコープまたは完全に異なるスコープのセットがグラントされることがあります。

source: Additionally, a complex application might need to exchange or update the tokens before propagating them. For example, the access context might differ when `Service A` accesses `Service B`. In this case, `Service A` might be granted a narrow or completely different set of scopes to access `Service B`.
ja_jp: さらに、複雑なアプリケーションでは、トークンを伝播する前に交換または更新する必要がある場合があります。たとえば、 `Service A` が `Service B` にアクセスするとき、アクセスコンテキストが異なる場合があります。この場合、`Service A` は `Service B` にアクセスするために、狭いスコープまたは完全に異なるスコープのセットを付与される場合があります。

source: Additionally, a complex application might need to exchange or update the tokens before propagating them. For example, the access context might be different when `Service A` is accessing `Service B`. In this case, `Service A` might be granted a narrow or completely different set of scopes to access `Service B`.
ja_jp: さらに、複雑なアプリケーションでは、トークンを伝搬する前に交換または更新する必要がある場合があります。たとえば、 `Service A` が `Service B` にアクセスするとき、アクセスコンテキストが異なる場合があります。この例では、 `Service B` にアクセスするために `Service A` に付与されるスコープは、範囲が狭いか、完全に異なる場合があります。

source: Additionally, a custom `SecurityIdentityAugmentor` can also be used to add the roles as documented in xref:security-customization.adoc#security-identity-customization[Security Identity Customization].
ja_jp: さらに、カスタム `SecurityIdentityAugmentor` をロールの追加に使用することもできます。詳しくは、 xref:security-customization.adoc#security-identity-customization[Security Identityのカスタマイズ] を参照してください。

source: Additionally, a custom `SecurityIdentityAugmentor` can also be used to add the roles as documented xref:security-overview-concept.adoc#security-identity-customization[here].
ja_jp: さらに、xref:security.adoc#security-identity-customization[ここ] に文書化されているようにロールを追加することにカスタム `SecurityIdentityAugmentor` を使用することも出来ます。

source: Additionally, a custom `SecurityIdentityAugmentor` can also be used to add the roles as documented xref:security.adoc#security-identity-customization[here].
ja_jp: さらに、カスタム `SecurityIdentityAugmentor` を使用して、xref:security.adoc#security-identity-customization[ここ] に文書化されているようにロールを追加することもできます。

source: Additionally, a custom `SecurityIdentityAugmentor` can also be used to add the roles. For more information, see the xref:security-customization.adoc#security-identity-customization[Security identity customization] section of the Quarkus "Security tips and tricks" guide.
ja_jp: さらに、カスタムの `SecurityIdentityAugmentor` を使用してロールを追加することもできます。 詳細は、Quarkus の「セキュリティーに関するヒントとコツ」ガイドの xref:security-customization.adoc#security-identity-customization[セキュリティーアイデンティティーのカスタマイズ] セクションを参照してください。

source: Additionally, a custom `SecurityIdentityAugmentor` can also be used to add the roles. For more information, see xref:security-customization.adoc#security-identity-customization[SecurityIdentity customization].
ja_jp: さらに、カスタム `SecurityIdentityAugmentor` をロールの追加に使用することもできます。詳しくは、 xref:security-customization.adoc#security-identity-customization[SecurityIdentityのカスタマイズ] を参照してください。

source: Additionally, any Java file with the marked `@CheckedTemplate` annotation will have its `TemplateInstance` fields also show the option to generate a corresponding Qute template, or navigate to the existing template file.
ja_jp: さらに、 `@CheckedTemplate` のアノテーションが付いた Java ファイルは、その `TemplateInstance` フィールドに、対応する Qute テンプレートを生成するか、既存のテンプレート・ファイルに移動するかのオプションが表示されます。

source: Additionally, any additional arguments can be provided to the binding's definition by using the `arguments` key:
ja_jp: さらに、 `arguments` キーを使って、バインディングの定義に追加の引数を提供できます。

source: Additionally, any additional arguments can be provided to the exchange's definition by using the `arguments` key:
ja_jp: さらに、 `arguments` キーを使用して、エクスチェンジの定義に追加の引数を提供できます。

source: Additionally, any additional arguments can be provided to the queue's definition by using the `arguments` key:
ja_jp: さらに、キューの定義に`arguments` キーで追加の引数を指定できます。

source: Additionally, any additional arguments may be provided to the binding's definition by using the `arguments` key:
ja_jp: さらに、 `arguments` キーを使って、バインディングの定義に追加の引数を提供することができます。

source: Additionally, any additional arguments may be provided to the exchange's definition by using the `arguments` key:
ja_jp: さらに、 `arguments` キーを使用して、エクスチェンジの定義に追加の引数を提供することができます。

source: Additionally, any additional arguments may be provided to the queue's definition by using the `arguments` key:
ja_jp: さらに、キューの定義に `arguments` キーで追加の引数を指定することができます。

source: Additionally, each extension that registers a custom CDI context via `ContextRegistrationPhaseBuildItem` should also produce the `CustomScopeBuildItem` in order to contribute the custom scope annotation name to the set of bean defining annotations.
ja_jp: さらに、 `ContextRegistrationPhaseBuildItem` を介してカスタム CDI コンテキストを登録する各エクステンションは、Bean 定義アノテーションのセットにカスタムスコープアノテーション名を提供するために、 `CustomScopeBuildItem` も生成する必要があります。

source: Additionally, for the OIDC `web-app` applications, the state and session cookies also provide a hint about the tenant resolved with one of the above mentioned options at the time when the authorization code flow started. See the <<tenant-resolution-for-web-app>> section for more information.
ja_jp: さらに、OIDC `web-app`アプリケーションの場合、状態とセッションの Cookie は、認可コードフローが開始された時点で上記のオプションのいずれかで解決されたテナントに関するヒントも提供します。詳細は、<<tenant-resolution-for-web-app>> セクションを参照してください。

source: Additionally, if Quarkus SmallRye Health is added to the application, a readiness check for the state of the gRPC services will be added to the MicroProfile Health endpoint response, that is `/q/health`.
ja_jp: さらに、Quarkus SmallRye Healthがアプリケーションに追加された場合、gRPCサービスの状態に関するレディネスチェックがMicroProfile Healthエンドポイントレスポンスに追加されます( `/q/health` )。

source: Additionally, if you are only interested in specifying the roles that are allowed to use the resources, the `@ResourceProperties` and `@MethodProperties` annotations have the field `rolesAllowed` to list the security roles permitted to access the resource or operation.
ja_jp: さらに、リソースの使用が許可されているロールの指定にのみ関心がある場合、 `@ResourceProperties` および `@MethodProperties` のアノテーションには、リソースまたは操作へのアクセスが許可されているセキュリティロールをリストアップするフィールド `rolesAllowed` があります。

source: Additionally, if you are using Linux, see the Podman https://podman.io/docs/installation#installing-on-linux[Linux installation documentation] for instructions installing Podman to your specific Linux distribution.
ja_jp: また、Linuxを使用している場合は、Podman link:https://podman.io/docs/installation#installing-on-linux[Linuxインストールドキュメント] を参照して、Podmanを特定のLinuxディストリビューションにインストールする手順を確認してください。

source: Additionally, individual applications can be deployed in a similar manner. Inside each service’s subdirectory in the repository is a `+deploy/k8s+` directory containing a similar matrix of Kubernetes descriptors.
ja_jp: さらに、個々のアプリケーションも同様の方法でデプロイできます。リポジトリ内の各サービスのサブディレクトリの中には、同様のKubernetesディスクリプターのマトリックスを含む `deploy/k8s` ディレクトリがあります。

source: Additionally, it is possible to define minimum spacing between invocations. For example, with a minimum spacing of 1 second, if a second invocation happens 500 millis after the first, it is rejected even if the limit would not be exceeded yet.
ja_jp: さらに、呼び出しと呼び出しの間の最小間隔を定義することもできます。たとえば、最小間隔が 1 秒の場合、最初の呼び出しから 500 ミリ秒後に 2 番目の呼び出しが行われた場合、制限を超えていなくても拒否されます。

source: Additionally, rather than extending both `PagingAndSortingRepository` and `CrudRepository`, you can use `JpaRepository`, which is a higher-level abstraction tailored for JPA. Since `JpaRepository` already extends both `PagingAndSortingRepository` and `CrudRepository`, it can replace `CrudRepository` directly.
ja_jp: さらに、 `PagingAndSortingRepository` と `CrudRepository` の両方を拡張するのではなく、JPA用に調整されたより高レベルの抽象化である `JpaRepository` を使用することもできます。 `JpaRepository` はすでに `PagingAndSortingRepository` と `CrudRepository` の両方を拡張しているので、 `CrudRepository` を直接置き換えることができます。

source: Additionally, refer to the Quarkus xref:hibernate-orm.adoc[Hibernate ORM] guide for information about consuming and using a JDBC datasource.
ja_jp: さらに、JDBC データソースの消費と使用については、Quarkus xref:hibernate-orm.adoc[Hibernate ORM] ガイドを参照してください。

source: Additionally, refer to the Quarkus xref:hibernate-orm.adoc[Hibernate ORM] guide for information on consuming and using a JDBC datasource.
ja_jp: さらに、JDBCデータソースの消費と使用については、Quarkus xref:hibernate-orm.adoc[Hibernate ORM] ガイドを参照してください。

source: Additionally, starting with `com.google.cloud.sql:postgres-socket-factory:1.17.0`, you must also mark `com.kenai.jffi.internal.Cleaner` as runtime initialized.
ja_jp: さらに、 `com.google.cloud.sql:postgres-socket-factory:1.17.0` からは、 `com.kenai.jffi.internal.Cleaner` を実行時初期化としてマークする必要があります。

source: Additionally, the Expression Expansion engine supports the following segments:
ja_jp: さらに、式拡張エンジンは次のセグメントをサポートします。

source: Additionally, the Fight service https://quarkus.io/guides/kafka#integrating-with-kafka-common-patterns[emits^] fight events in https://avro.apache.org/docs/current[Apache Avro^] format to Kafka. The fight schema is automatically registered in an https://www.apicur.io/registry[Apicurio Schema Registry^] by the https://quarkus.io/guides/kafka-schema-registry-avro[Quarkus Apicurio Avro extension^].
ja_jp: さらに、Fightサービスは、 link:https://avro.apache.org/docs/current[Apache Avro, window=_blank]形式のファイトイベントをKafkaに link:https://quarkus.io/guides/kafka#integrating-with-kafka-common-patterns[エミットし, window=_blank]ます。Fightスキーマは、 link:https://quarkus.io/guides/kafka-schema-registry-avro[QuarkusのApicurio Avroエクステンション, window=_blank]によって、 link:https://www.apicur.io/registry[Apicurio Schema Registry, window=_blank]に自動的に登録されます。

source: Additionally, the `ObjectMapper` formats dates and times in ISO-8601 (by disabling `SerializationFeature.WRITE_DATES_AS_TIMESTAMPS`).
ja_jp: さらに、`ObjectMapper` は、(`SerializationFeature.WRITE_DATES_AS_TIMESTAMPS` を無効にして) 日付と時刻を ISO-8601 でフォーマットします 。

source: Additionally, the `io.quarkus.vertx.http.security.HttpSecurity` CDI event can be used to configure specific authentication mechanisms and policies:
ja_jp: さらに、 `io.quarkus.vertx.http.security.HttpSecurity` CDI イベントを使用して、特定の認証メカニズムとポリシーを設定できます。

source: Additionally, the bean resolver returned from `BeanDiscoveryFinishedBuildItem#getBeanResolver()` can be used to apply the type-safe resolution rules, e.g. to find out whether there is a bean that would satisfy certain combination of required type and qualifiers.
ja_jp: さらに、 `BeanDiscoveryFinishedBuildItem#getBeanResolver()` から返された Bean リゾルバーを使用して、タイプセーフな解決ルールを適用できます。たとえば、必要な型と修飾子の特定の組み合わせを満たす Bean があるかどうかを確認できます。

source: Additionally, the bean resolver returned from `SynthesisFinishedBuildItem#getBeanResolver()` can be used to apply the type-safe resolution rules, e.g. to find out whether there is a bean that would satisfy certain combination of required type and qualifiers.
ja_jp: さらに、 `SynthesisFinishedBuildItem#getBeanResolver()` から返された Bean リゾルバーを使用して、タイプセーフな解決ルールを適用できます。たとえば、必要な型と修飾子の特定の組み合わせを満たす Bean があるかどうかを確認できます。

source: Additionally, the extension should produce a `io.quarkus.oidc.deployment.devservices.OidcProviderBuildItem` to disable the default `Dev Services for Keycloak`, instead of the users having to type `quarkus.keycloak.devservices.enabled=false`.
ja_jp: さらに、ユーザーが `quarkus.keycloak.devservices.enabled=false` を入力するのではなく、エクステンションが `io.quarkus.oidc.deployment.devservices.OidcProviderBuildItem` を生成してデフォルトの `Dev Services for Keycloak` を無効にする必要があります。

source: Additionally, the index page for static resources can be changed from default `index.html`, the hidden files (e.g. dot files) can be indicated as not served, the range requests can be disabled, and the caching support (e.g. caching headers and file properties cache) can be configured.
ja_jp: さらに、静的リソースのインデックスページをデフォルトの `index.html` から変更すること、隠しファイル（ドットファイルなど）を提供しないことを示すこと、範囲要求を無効にすること、キャッシュ対応（ヘッダーのキャッシュ、ファイルのプロパティのキャッシュなど）を設定することができます。

source: Additionally, the team also utilizes a number of Quarkus extensions for testing, including:
ja_jp: さらに、チームはテスト用に以下のような多数のQuarkusエクステンションも活用しています。

source: Additionally, the user will have to configure which build image to use (no default image is provided). For example:
ja_jp: さらに、ユーザーはどのビルドイメージを使用するかを設定する必要があります（デフォルトのイメージは提供されていません）。例えば、以下のようになります。

source: Additionally, we can limit the number of redirections using the property "max-redirects".
ja_jp: さらに、プロパティ "max-redirects" を使って、リダイレクトの回数を制限することができます。

source: Additionally, xref:dev-ui.adoc[Dev UI] available at http://localhost:8080/q/dev-ui/extensions[/q/dev-ui/extensions] complements this feature with a Dev UI page, which helps to acquire the tokens from Keycloak and test your Quarkus application.
ja_jp: さらに、http://localhost:8080/q/dev-ui/extensions[/q/dev-ui/extensions] で入手可能な xref:dev-ui.adoc[Dev UI] は、Keycloak からトークンを取得して Quarkus アプリケーションをテストするのに役立つ Dev UI ページでこの機能を補完します。

source: Additionally, xref:dev-ui.adoc[Dev UI] available at http://localhost:8080/q/dev[/q/dev] complements this feature with a Dev UI page which helps to Query Data Index via its GraphQL UI.
ja_jp: さらに、 link:http://localhost:8080/q/dev[/q/dev]で利用可能な link:dev-ui.html[Dev UI] は、GraphQL UIを介してデータ・インデックスを照会するのに役立つDev UIページでこの機能を補完します。

source: Additionally, xref:dev-ui.adoc[Dev UI] available at http://localhost:8080/q/dev[/q/dev] complements this feature with a Dev UI page which helps to Query Data Index via its GraphiQL UI.
ja_jp: さらに、 link:http://localhost:8080/q/dev[/q/dev]で利用可能な link:dev-ui.html[Dev UI]は、GraphiQL UIを介してデータ・インデックスを照会するのに役立つDev UIページでこの機能を補完します。

source: Additionally, xref:dev-ui.adoc[Dev UI] available at http://localhost:8080/q/dev[/q/dev] complements this feature with a Dev UI page which helps to acquire the tokens from Keycloak and test your Quarkus application.
ja_jp: さらに、 http://localhost:8080/q/dev[/q/dev] で入手可能な xref:dev-ui.adoc[Dev UI] は、Dev UI ページでこの機能を補完します。これは、Keycloak からトークンを取得して Quarkus アプリケーションをテストする際に役立ちます。

source: Additionally, xref:dev-ui.adoc[Dev UI] available at http://localhost:8080/q/dev[/q/dev] complements this feature with a Dev UI page, which helps to acquire the tokens from Keycloak and test your Quarkus application.
ja_jp: さらに、 http://localhost:8080/q/dev[/q/dev] で入手可能な xref:dev-ui.adoc[Dev UI] は、Dev UI ページでこの機能を補完します。これは、Keycloak からトークンを取得して Quarkus アプリケーションをテストする際に役立ちます。

source: Additionally, you can also add new Ingress rules by adding the following configuration:
ja_jp: 以下の設定を適用することで、新しいIngressルールを追加することもできます:

source: Additionally, you can also filter by the entity fields by adding a query param with the name of the field and the value, for example, calling `http://localhost:8080/people?name=Peter Peterson` would return:
ja_jp: さらに、フィールド名と値を含むクエリパラメータを追加することで、エンティティフィールドでフィルタリングすることも可能です。 `http://localhost:8080/people?name=Peter Peterson` を呼び出すと、次が返却されるでしょう。

source: Additionally, you can also manually append the parts of the form using the class `MultipartFormDataOutput` as:
ja_jp: さらに、クラス `MultipartFormDataOutput` を使用して、フォームのパーツを手動で追加することも可能です:

source: Additionally, you can also use a custom `SecurityIdentityAugmentor` to add the roles. For more information, see xref:security-customization.adoc#security-identity-customization[SecurityIdentity customization]. You can also map `SecurityIdentity` roles created from token claims to deployment-specific roles with the xref:security-authorize-web-endpoints-reference.adoc#map-security-identity-roles[HTTP Security policy].
ja_jp: さらに、カスタム `SecurityIdentityAugmentor` を使用してロールを追加することもできます。 詳細は、xref:security-customization.adoc#security-identity-customization[SecurityIdentity カスタマイズ] を参照してください。 また、xref:security-authorize-web-endpoints-reference.adoc#map-security-identity-roles[HTTP Security ポリシー] を使用して、トークン要求から作成された `SecurityIdentity` ロールをデプロイメント固有のロールにマップすることもできます。

source: Additionally, you can set the maximum time to wait (`max-delay`), which specifies an upper bound for time shaping. By default, it is set to 15 seconds. It must be less than the HTTP timeout. When one of the threshold is reached, no write happens for that period of time.
ja_jp: さらに、最大待機時間 ( `max-delay` ) を設定できます。これは、タイムシェーピングの上限を指定するものです。 デフォルトでは 15 秒に設定されています。 これは HTTP タイムアウトより小さくなければなりません。 しきい値のいずれかに達すると、その期間書き込みは行われません。

source: Additionally, you can specify attributes for the identity, perhaps custom items that were added with identity augmentation:
ja_jp: さらに、アイデンティティーの属性、たとえばアイデンティティー拡張で追加されたカスタム項目を指定することもできます。

source: Additionally, you can use the `quarkus.oidc-client.refresh-token-time-skew` property for preemptive access token refresh to avoid sending nearly expired access tokens that might cause HTTP 401 errors.
ja_jp: さらに、HTTP 401 エラーの原因となる可能性のある期限切れに近いアクセストークンの送信を避けるために、 `quarkus.oidc-client.refresh-token-time-skew` プロパティーを使用して事前にアクセストークンを更新できます。

source: Additionally, you cannot update configuration properties at runtime. If you modify `application.properties` or `hotrod-client.properties`, you must rebuild the application before those changes take effect.
ja_jp: さらに、実行時にコンフィギュレーションプロパティを更新することはできません。 もし、 `application.properties` や `hotrod-client.properties` を変更した場合、その変更を反映させる前にアプリケーションをリビルドしなければなりません。

source: Additionaly, the bean resolver returned from `BeanDiscoveryFinishedBuildItem#getBeanResolver()` can be used to apply the type-safe resolution rules, e.g. to find out whether there is a bean that would satisfy certain combination of required type and qualifiers.
ja_jp: さらに、 `BeanDiscoveryFinishedBuildItem#getBeanResolver()` から返された Bean リゾルバーを使用して、タイプセーフな解決ルールを適用できます。たとえば、必要なタイプと修飾子の特定の組み合わせを満たす Bean があるかどうかを確認できます。

source: Additionaly, the bean resolver returned from `SynthesisFinishedBuildItem#getBeanResolver()` can be used to apply the type-safe resolution rules, e.g. to find out whether there is a bean that would satisfy certain combination of required type and qualifiers.
ja_jp: さらに、 `SynthesisFinishedBuildItem#getBeanResolver()` から返された Bean リゾルバーを使用して、タイプセーフな解決ルールを適用できます。たとえば、必要なタイプと修飾子の特定の組み合わせを満たす Bean があるかどうかを確認できます。

source: Address of SOCKS5 proxy.
ja_jp: SOCKS5プロキシのアドレス。

source: Address: Start address of virtual address space
ja_jp: Address: 仮想アドレス空間の開始アドレス

source: Adds a `birthdate` claim. Because this can be considered sensitive information, consider encrypting claims as described in xref:security-jwt-build.adoc[Generate JWT tokens with SmallRye JWT].
ja_jp: `birthdate` クレームを追加します。 これは機密情報とみなされる可能性があるため、xref:security-jwt-build.adoc[SmallRye JWT を使用して JWT トークンを生成する] で説明されているようにクレームを暗号化することを検討してください。

source: Adds all monitoring options.
ja_jp: すべての監視オプションを追加

source: Adds certificate role mapping.
ja_jp: 証明書ロールマッピングを追加します。

source: Adds jvmstat support
ja_jp: jvmstat のサポートを追加

source: Adds support for accepting connections from JMX clients.
ja_jp: JMX クライアントからの接続を受け入れるためのサポートを追加

source: Adds support for connections to JMX servers.
ja_jp: JMX サーバーへの接続のサポートを追加

source: Adds support for dumping thread stacks on SIGQUIT/SIGBREAK.
ja_jp: SIGQUIT/SIGBREAK 時のスレッドスタックダンプのサポートを追加

source: Adds support for generating heap dumps
ja_jp: ヒープダンプ生成のサポートを追加

source: Adds support for native memory tracking.
ja_jp: ネイティブメモリートラッキングのサポートを追加

source: Adjust the `TimeTableResourceTest` instance accordingly, now that the `solve()` method returns immediately. Poll for the latest solution until the solver finishes solving:
ja_jp: `TimeTableResourceTest` インスタンスを適切に調整します。これで、 `solve()` メソッドがすぐに返されます。ソルバーが解決を完了するまで、最新のソリューションをポーリングします。

source: Adjust the `TimeTableResource` to read and write a `TimeTable` instance in a single transaction and use those accordingly:
ja_jp: `TimeTableResource` を調整して、単一のトランザクションで `TimeTable` インスタンスを読み書きし、適切にそれらを使用します。

source: Adjust the host and port number according to your Infinispan server installation.
ja_jp: Infinispan サーバーのインストールに合わせて、ホストとポート番号を調整します。

source: Adjust the packages to use the `jakarta.*` packages
ja_jp: `jakarta.*` のパッケージを使用するように調整してください

source: Adjust your configuration files when configuration properties have changed
ja_jp: 設定プロパティが変更された場合に、設定ファイルを調整してください

source: Adjust your dependencies in some cases
ja_jp: 場合によっては、依存関係を調整してください

source: Adjusting the registry cache update policy
ja_jp: レジストリキャッシュ更新ポリシーの調整
